phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/uart.c
/*
 * Phoenix-RTOS
 *
 * iMX RT UART driver
 *
 * Copyright 2017-2019 Phoenix Systems
 * Author: Kamil Amanowicz, Marek Bialowas, Aleksander Kaminski
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */


#include <errno.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <sys/file.h>
#include <sys/interrupt.h>
#include <sys/ioctl.h>
#include <sys/msg.h>
#include <sys/threads.h>

#include <libtty.h>
#include <libtty-lf-fifo.h>
#include <libklog.h>

#include "gpio.h"
#include "common.h"
#include "uart.h"


#define UART1_POS  0
#define UART2_POS  (UART1_POS + UART1)
#define UART3_POS  (UART2_POS + UART2)
#define UART4_POS  (UART3_POS + UART3)
#define UART5_POS  (UART4_POS + UART4)
#define UART6_POS  (UART5_POS + UART5)
#define UART7_POS  (UART6_POS + UART6)
#define UART8_POS  (UART7_POS + UART7)
#define UART9_POS  (UART8_POS + UART8)
#define UART10_POS (UART9_POS + UART9)
#define UART11_POS (UART10_POS + UART10)
#define UART12_POS (UART11_POS + UART11)

#define UART_CNT (UART1 + UART2 + UART3 + UART4 + UART5 + UART6 + UART7 + UART8 + UART9 + UART10 + UART11 + UART12)


#ifndef UART_RXFIFOSIZE
#define UART_RXFIFOSIZE 128
#endif


typedef struct {
	uint16_t port;
	uint8_t pin;
	uint8_t onTx;
} uart_halfDuplexAction_t;


typedef struct uart_s {
	char stack[1024] __attribute__ ((aligned(8)));

	volatile uint32_t *base;
	uint32_t mode;
	uint16_t dev_no;
	uart_halfDuplexAction_t halfDuplexAction;

	handle_t cond;
	handle_t inth;
	handle_t lock;

	size_t rxFifoSz;
	size_t txFifoSz;

	libtty_common_t tty_common;

	/* fifo between irq and thread */
	lf_fifo_t rxFifoCtx;
	uint8_t rxFifoData[UART_RXFIFOSIZE];

	/* statistics */
	struct {
		/* NOTE: to read statistics use debugger */
		size_t hw_overrunCntr;
		size_t sw_overrunCntr;
	} stat;
} uart_t;


struct {
	uart_t uarts[UART_CNT];
} uart_common;


static const struct {
	volatile uint32_t *base;
	int clk;
	unsigned irq;
	int active;
	int pos;
	uart_halfDuplexAction_t halfDuplexAction;
} uart_preConfig[] = {
	{
		UART1_BASE,
		UART1_CLK,
		UART1_IRQ,
		UART1,
		UART1_POS,
		{ UART1_HALF_DUPLEX_GPIO },
	},
	{
		UART2_BASE,
		UART2_CLK,
		UART2_IRQ,
		UART2,
		UART2_POS,
		{ UART2_HALF_DUPLEX_GPIO },
	},
	{
		UART3_BASE,
		UART3_CLK,
		UART3_IRQ,
		UART3,
		UART3_POS,
		{ UART3_HALF_DUPLEX_GPIO },
	},
	{
		UART4_BASE,
		UART4_CLK,
		UART4_IRQ,
		UART4,
		UART4_POS,
		{ UART4_HALF_DUPLEX_GPIO },
	},
	{
		UART5_BASE,
		UART5_CLK,
		UART5_IRQ,
		UART5,
		UART5_POS,
		{ UART5_HALF_DUPLEX_GPIO },
	},
	{
		UART6_BASE,
		UART6_CLK,
		UART6_IRQ,
		UART6,
		UART6_POS,
		{ UART6_HALF_DUPLEX_GPIO },
	},
	{
		UART7_BASE,
		UART7_CLK,
		UART7_IRQ,
		UART7,
		UART7_POS,
		{ UART7_HALF_DUPLEX_GPIO },
	},
	{
		UART8_BASE,
		UART8_CLK,
		UART8_IRQ,
		UART8,
		UART8_POS,
		{ UART8_HALF_DUPLEX_GPIO },
	},
#ifdef __CPU_IMXRT117X
	{
		UART9_BASE,
		UART9_CLK,
		UART9_IRQ,
		UART9,
		UART9_POS,
		{ UART9_HALF_DUPLEX_GPIO },
	},
	{
		UART10_BASE,
		UART10_CLK,
		UART10_IRQ,
		UART10,
		UART10_POS,
		{ UART10_HALF_DUPLEX_GPIO },
	},
	{
		UART11_BASE,
		UART11_CLK,
		UART11_IRQ,
		UART11,
		UART11_POS,
		{ UART11_HALF_DUPLEX_GPIO },
	},
	{
		UART12_BASE,
		UART12_CLK,
		UART12_IRQ,
		UART12,
		UART12_POS,
		{ UART12_HALF_DUPLEX_GPIO },
	},
#endif
};


enum { veridr = 0, paramr, globalr, pincfgr, baudr, statr, ctrlr, datar, matchr, modirr, fifor, waterr };


static inline int uart_getRXcount(uart_t *uart)
{
	return (*(uart->base + waterr) >> 24) & 0xff;
}


static inline int uart_getTXcount(uart_t *uart)
{
	return (*(uart->base + waterr) >> 8) & 0xff;
}


static int uart_performHalfDuplexAction(const uart_halfDuplexAction_t *action, int tx)
{
	uint32_t val = ((tx != 0) ? 0 : 1) ^ ((action->onTx != 0) ? 1 : 0);
	return gpio_setPort(action->port, 1 << action->pin, val << action->pin);
}


static int uart_handleIntr(unsigned int n, void *arg)
{
	uart_t *uart = (uart_t *)arg;
	uint32_t status = *(uart->base + statr);

	/* Disable interrupts, enabled in uart_intrThread */
	*(uart->base + ctrlr) &= ~((1 << 27) | (1 << 26) | (1 << 25) | (1 << 23) | (1 << 22) | (1 << 21));

	/* check for RX overrun */
	if ((status & (1uL << 19u)) != 0u) {
		/* invalidate fifo */
		*(uart->base + fifor) |= 1uL << 14u;
		uart->stat.hw_overrunCntr++;
	}

	/* Process received data */
	while (uart_getRXcount(uart) != 0) {
		uint8_t data = *(uart->base + datar);
		if (lf_fifo_push(&uart->rxFifoCtx, data) == 0) {
			uart->stat.sw_overrunCntr++;
		}
	}

	/* Clear errors: parity, framing, noise, overrun and idle flag */
	*(uart->base + statr) = (status & (0x1fuL << 16));

	return 1;
}


static void uart_intrThread(void *arg)
{
	uart_t *uart = (uart_t *)arg;
	uint8_t mask;
	uint8_t c;
	int rxActive = 1;

	for (;;) {
		/* wait for character or transmit data */
		mutexLock(uart->lock);
		while (lf_fifo_empty(&uart->rxFifoCtx) != 0) { /* nothing to RX */
			uint32_t intrs = (1 << 27) | (1 << 26) | (1 << 25) | (1 << 21);
			if (libtty_txready(&uart->tty_common)) {          /* something to TX */
				if (uart_getTXcount(uart) < uart->txFifoSz) { /* TX ready */
					break;
				}
				else {
					intrs |= 1 << 23;
				}
			}

			if ((uart->halfDuplexAction.port != 0) && (rxActive == 0)) {
				uint32_t status = *(uart->base + statr);
				if ((status & (1 << 22)) != 0u) {
					/* Transmission finished, activate RX */
					uart_performHalfDuplexAction(&uart->halfDuplexAction, 0);
					*(uart->base + ctrlr) |= (1 << 18);
					rxActive = 1;
				}
				else {
					/* Transmission in progress, activate interrupt */
					intrs |= (1 << 22);
				}
			}

			*(uart->base + ctrlr) |= intrs;

			condWait(uart->cond, uart->lock, 0);
		}

		if ((uart->tty_common.term.c_cflag & CSIZE) == CS7) {
			mask = 0x7f;
		}
		else {
			mask = 0xff;
		}

		mutexUnlock(uart->lock);

		/* RX */
		while (lf_fifo_pop(&uart->rxFifoCtx, &c) != 0) {
			libtty_putchar(&uart->tty_common, c & mask, NULL);
		}

		/* TX */
		if (libtty_txready(&uart->tty_common) && uart_getTXcount(uart) < uart->txFifoSz) {
			if ((uart->halfDuplexAction.port != 0) && (rxActive != 0)) {
				*(uart->base + ctrlr) &= ~(1 << 18);
				uart_performHalfDuplexAction(&uart->halfDuplexAction, 1);
				rxActive = 0;
			}

			do {
				*(uart->base + datar) = libtty_getchar(&uart->tty_common, NULL);
			} while (libtty_txready(&uart->tty_common) && uart_getTXcount(uart) < uart->txFifoSz);
		}
	}
}


static void signal_txready(void *_uart)
{
	uart_t *uartptr = (uart_t *)_uart;
	condSignal(uartptr->cond);
}


static void set_cflag(void *_uart, tcflag_t *cflag)
{
	uart_t *uartptr = (uart_t *)_uart;
	uint32_t t;

