phoenix-rtos/phoenix-rtos-devices/multi/imxrt-multi/uart.c
	return 0;
}


static void uart_initPins(void)
{
	int i, j, isel, val;
	static const struct {
		int uart;
		int muxes[2];
		int pads[2];
	} info[] = {
	/* clang-format off */
#if UART1
		{ 0,
		{ PIN2MUX(UART1_TX_PIN), PIN2MUX(UART1_RX_PIN) },
		{ PIN2PAD(UART1_TX_PIN), PIN2PAD(UART1_RX_PIN) } },
#if UART1_HW_FLOWCTRL
		{ 0,
		{ PIN2MUX(UART1_RTS_PIN), PIN2MUX(UART1_CTS_PIN) },
		{ PIN2PAD(UART1_RTS_PIN), PIN2PAD(UART1_CTS_PIN) } },
#endif
#endif

#if UART2
		{ 1,
		{ PIN2MUX(UART2_TX_PIN), PIN2MUX(UART2_RX_PIN) },
		{ PIN2PAD(UART2_TX_PIN), PIN2PAD(UART2_RX_PIN) } },
#if UART2_HW_FLOWCTRL
		{ 1,
		{ PIN2MUX(UART2_RTS_PIN), PIN2MUX(UART2_CTS_PIN) },
		{ PIN2PAD(UART2_RTS_PIN), PIN2PAD(UART2_CTS_PIN) } },
#endif
#endif

#if UART3
		{ 2,
		{ PIN2MUX(UART3_TX_PIN), PIN2MUX(UART3_RX_PIN) },
		{ PIN2PAD(UART3_TX_PIN), PIN2PAD(UART3_RX_PIN) } },
#if UART3_HW_FLOWCTRL
		{ 2,
		{ PIN2MUX(UART3_RTS_PIN), PIN2MUX(UART3_CTS_PIN) },
		{ PIN2PAD(UART3_RTS_PIN), PIN2PAD(UART3_CTS_PIN) } },
#endif
#endif

#if UART4
		{ 3,
		{ PIN2MUX(UART4_TX_PIN), PIN2MUX(UART4_RX_PIN) },
		{ PIN2PAD(UART4_TX_PIN), PIN2PAD(UART4_RX_PIN) } },
#if UART4_HW_FLOWCTRL
		{ 3,
		{ PIN2MUX(UART4_RTS_PIN), PIN2MUX(UART4_CTS_PIN) },
		{ PIN2PAD(UART4_RTS_PIN), PIN2PAD(UART4_CTS_PIN) } },
#endif
#endif

#if UART5
		{ 4,
		{ PIN2MUX(UART5_TX_PIN), PIN2MUX(UART5_RX_PIN) },
		{ PIN2PAD(UART5_TX_PIN), PIN2PAD(UART5_RX_PIN) } },
#if UART5_HW_FLOWCTRL
		{ 4,
		{ PIN2MUX(UART5_RTS_PIN), PIN2MUX(UART5_CTS_PIN) },
		{ PIN2PAD(UART5_RTS_PIN), PIN2PAD(UART5_CTS_PIN) } },
#endif
#endif

#if UART6
		{ 5,
		{ PIN2MUX(UART6_TX_PIN), PIN2MUX(UART6_RX_PIN) },
		{ PIN2PAD(UART6_TX_PIN), PIN2PAD(UART6_RX_PIN) } },
#if UART6_HW_FLOWCTRL
		{ 5,
		{ PIN2MUX(UART6_RTS_PIN), PIN2MUX(UART6_CTS_PIN) },
		{ PIN2PAD(UART6_RTS_PIN), PIN2PAD(UART6_CTS_PIN) } },
#endif
#endif

#if UART7
		{ 6,
		{ PIN2MUX(UART7_TX_PIN), PIN2MUX(UART7_RX_PIN) },
		{ PIN2PAD(UART7_TX_PIN), PIN2PAD(UART7_RX_PIN) } },
#if UART7_HW_FLOWCTRL
		{ 6,
		{ PIN2MUX(UART7_RTS_PIN), PIN2MUX(UART7_CTS_PIN) },
		{ PIN2PAD(UART7_RTS_PIN), PIN2PAD(UART7_CTS_PIN) } },
#endif
#endif

#if UART8
		{ 7,
		{ PIN2MUX(UART8_TX_PIN), PIN2MUX(UART8_RX_PIN) },
		{ PIN2PAD(UART8_TX_PIN), PIN2PAD(UART8_RX_PIN) } },
#if UART8_HW_FLOWCTRL
		{ 7,
		{ PIN2MUX(UART8_RTS_PIN), PIN2MUX(UART8_CTS_PIN) },
		{ PIN2PAD(UART8_RTS_PIN), PIN2PAD(UART8_CTS_PIN) } },
#endif
#endif

#if UART9
		{ 8,
		{ PIN2MUX(UART9_TX_PIN), PIN2MUX(UART9_RX_PIN) },
		{ PIN2PAD(UART9_TX_PIN), PIN2PAD(UART9_RX_PIN) } },
#if UART9_HW_FLOWCTRL
		{ 8,
		{ PIN2MUX(UART9_RTS_PIN), PIN2MUX(UART9_CTS_PIN) },
		{ PIN2PAD(UART9_RTS_PIN), PIN2PAD(UART9_CTS_PIN) } },
#endif
#endif

#if UART10
		{ 9,
		{ PIN2MUX(UART10_TX_PIN), PIN2MUX(UART10_RX_PIN) },
		{ PIN2PAD(UART10_TX_PIN), PIN2PAD(UART10_RX_PIN) } },
#if UART10_HW_FLOWCTRL
		{ 9,
		{ PIN2MUX(UART10_RTS_PIN), PIN2MUX(UART10_CTS_PIN) },
		{ PIN2PAD(UART10_RTS_PIN), PIN2PAD(UART10_CTS_PIN) } },
#endif
#endif

#if UART11
		{ 10,
		{ PIN2MUX(UART11_TX_PIN), PIN2MUX(UART11_RX_PIN) },
		{ PIN2PAD(UART11_TX_PIN), PIN2PAD(UART11_RX_PIN) } },
#if UART11_HW_FLOWCTRL
		{ 10,
		{ PIN2MUX(UART11_RTS_PIN), PIN2MUX(UART11_CTS_PIN) },
		{ PIN2PAD(UART11_RTS_PIN), PIN2PAD(UART11_CTS_PIN) } },
#endif
#endif

#if UART12
		{ 11,
		{ PIN2MUX(UART12_TX_PIN), PIN2MUX(UART12_RX_PIN) },
		{ PIN2PAD(UART12_TX_PIN), PIN2PAD(UART12_RX_PIN) } },
#if UART12_HW_FLOWCTRL
		{ 11,
		{ PIN2MUX(UART12_RTS_PIN), PIN2MUX(UART12_CTS_PIN) },
		{ PIN2PAD(UART12_RTS_PIN), PIN2PAD(UART12_CTS_PIN) } },
#endif
#endif
	};
	/* clang-format on */

	for (i = 0; i < sizeof(info) / sizeof(info[0]); ++i) {
		for (j = 0; j < sizeof(info[0].muxes) / sizeof(info[0].muxes[0]); ++j) {
			common_setMux(info[i].muxes[j], 0, uart_muxVal(info[i].uart, info[i].muxes[j]));

			if (uart_getIsel(info[i].uart, info[i].muxes[j], &isel, &val) >= 0)
				common_setInput(isel, val);
		}

		common_setPad(info[i].pads[0], 0, 0, 0, 0, 0, 0, 0, 0);
		common_setPad(info[i].pads[1], 0, 1, 1, 1, 0, 0, 0, 0);
	}
}

#else

static int uart_muxVal(int mux)
{
	switch (mux) {
		case pctl_mux_gpio_b1_12:
		case pctl_mux_gpio_b1_13:
			return 1;

		case pctl_mux_gpio_b0_08:
		case pctl_mux_gpio_b0_09:
			return 3;

		case pctl_mux_gpio_sd_b1_00:
		case pctl_mux_gpio_sd_b1_01:
			return 4;
	}

	return 2;
}


static int uart_getIsel(int mux, int *isel, int *val)
{
	switch (mux) {
		case pctl_mux_gpio_ad_b1_02: *isel = pctl_isel_lpuart2_tx; *val = 1; break;
		case pctl_mux_gpio_sd_b1_11: *isel = pctl_isel_lpuart2_tx; *val = 0; break;
		case pctl_mux_gpio_ad_b1_03: *isel = pctl_isel_lpuart2_rx; *val = 1; break;
		case pctl_mux_gpio_sd_b1_10: *isel = pctl_isel_lpuart2_rx; *val = 0; break;
		case pctl_mux_gpio_emc_13:   *isel = pctl_isel_lpuart3_tx; *val = 1; break;
		case pctl_mux_gpio_ad_b1_06: *isel = pctl_isel_lpuart3_tx; *val = 0; break;
		case pctl_mux_gpio_b0_08:    *isel = pctl_isel_lpuart3_tx; *val = 2; break;
		case pctl_mux_gpio_emc_14:   *isel = pctl_isel_lpuart3_rx; *val = 1; break;
		case pctl_mux_gpio_ad_b1_07: *isel = pctl_isel_lpuart3_rx; *val = 0; break;
		case pctl_mux_gpio_b0_09:    *isel = pctl_isel_lpuart3_rx; *val = 2; break;
		case pctl_mux_gpio_emc_15:   *isel = pctl_isel_lpuart3_cts_b; *val = 0; break;
		case pctl_mux_gpio_ad_b1_04: *isel = pctl_isel_lpuart3_cts_b; *val = 1; break;
		case pctl_mux_gpio_emc_19:   *isel = pctl_isel_lpuart4_tx; *val = 1; break;
		case pctl_mux_gpio_b1_00:    *isel = pctl_isel_lpuart4_tx; *val = 2; break;
		case pctl_mux_gpio_sd_b1_00: *isel = pctl_isel_lpuart4_tx; *val = 0; break;
		case pctl_mux_gpio_emc_20:   *isel = pctl_isel_lpuart4_rx; *val = 1; break;
		case pctl_mux_gpio_b1_01:    *isel = pctl_isel_lpuart4_rx; *val = 2; break;
		case pctl_mux_gpio_sd_b1_01: *isel = pctl_isel_lpuart4_rx; *val = 0; break;
		case pctl_mux_gpio_emc_23:   *isel = pctl_isel_lpuart5_tx; *val = 0; break;
		case pctl_mux_gpio_b1_12:    *isel = pctl_isel_lpuart5_tx; *val = 1; break;
		case pctl_mux_gpio_emc_24:   *isel = pctl_isel_lpuart5_rx; *val = 0; break;
		case pctl_mux_gpio_b1_13:    *isel = pctl_isel_lpuart5_rx; *val = 1; break;
		case pctl_mux_gpio_emc_25:   *isel = pctl_isel_lpuart6_tx; *val = 0; break;
		case pctl_mux_gpio_ad_b0_12: *isel = pctl_isel_lpuart6_tx; *val = 1; break;
		case pctl_mux_gpio_emc_26:   *isel = pctl_isel_lpuart6_rx; *val = 0; break;
		case pctl_mux_gpio_ad_b0_03: *isel = pctl_isel_lpuart6_rx; *val = 1; break;
		case pctl_mux_gpio_emc_31:   *isel = pctl_isel_lpuart7_tx; *val = 1; break;
		case pctl_mux_gpio_sd_b1_08: *isel = pctl_isel_lpuart7_tx; *val = 0; break;
		case pctl_mux_gpio_emc_32:   *isel = pctl_isel_lpuart7_rx; *val = 1; break;
		case pctl_mux_gpio_sd_b1_09: *isel = pctl_isel_lpuart7_rx; *val = 0; break;
		case pctl_mux_gpio_emc_38:   *isel = pctl_isel_lpuart8_tx; *val = 2; break;
		case pctl_mux_gpio_ad_b1_10: *isel = pctl_isel_lpuart8_tx; *val = 1; break;
		case pctl_mux_gpio_sd_b0_04: *isel = pctl_isel_lpuart8_tx; *val = 0; break;
		case pctl_mux_gpio_emc_39:   *isel = pctl_isel_lpuart8_rx; *val = 2; break;
		case pctl_mux_gpio_ad_b1_11: *isel = pctl_isel_lpuart8_rx; *val = 1; break;
		case pctl_mux_gpio_sd_b0_05: *isel = pctl_isel_lpuart8_rx; *val = 0; break;
		default: return -1;
	}

